class Book:
    """Класс, представляющий книгу
    """

    def __init__(self, title, year, genre):
        """Конструктор

        Задание: сохраните title, year и genre в виде
        атрибутов объекта self
        """

    def __repr__(self):
        """Возвращает внутреннее строковое представление объекта
        для консоли, отладчика и т.д.

        Задание: верните строку в формате
                 Book("название", год, "жанр")
        """

    def __str__(self):
        """Возвращает строку, предназначенную для пользователя
        (str, print и т.д.)

        Задание: верните строку в произвольном формате
        """


# Задание: создайте несколько объектов класса Book
# и выведите их на экран
